<a href="https://colab.research.google.com/github/pranavkerkar31/AI-ML/blob/main/pandas2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [2]:
import numpy as np

Data Frames

In [3]:
data = {
    "names":["pranav","kerkar", "rahul", "rohit"],
    "age":[12,13,np.nan,19],
    "dept":["it","comp","mech","ecs"],
    "salary":[12000,13000,np.nan,20000]
}
data

{'names': ['pranav', 'kerkar', 'rahul', 'rohit'],
 'age': [12, 13, nan, 19],
 'dept': ['it', 'comp', 'mech', 'ecs'],
 'salary': [12000, 13000, nan, 20000]}

In [4]:
df = pd.DataFrame(data)
df

    names   age  dept   salary
0  pranav  12.0    it  12000.0
1  kerkar  13.0  comp  13000.0
2   rahul   NaN  mech      NaN
3   rohit  19.0   ecs  20000.0

In [5]:
print(df.head(3))
print(df.tail(1))

    names   age  dept   salary
0  pranav  12.0    it  12000.0
1  kerkar  13.0  comp  13000.0
2   rahul   NaN  mech      NaN
   names   age dept   salary
3  rohit  19.0  ecs  20000.0

In [6]:
df.iloc[0:3] # only the last value is not considered

    names   age  dept   salary
0  pranav  12.0    it  12000.0
1  kerkar  13.0  comp  13000.0
2   rahul   NaN  mech      NaN

In [7]:
df.loc[0:3] # all index values are considered

    names   age  dept   salary
0  pranav  12.0    it  12000.0
1  kerkar  13.0  comp  13000.0
2   rahul   NaN  mech      NaN
3   rohit  19.0   ecs  20000.0

In [8]:
print(df["age"]) # to access single col
print(df[["age",'dept']]) # two brackets for accessing two colouns

0    12.0
1    13.0
2     NaN
3    19.0
Name: age, dtype: float64
    age  dept
0  12.0    it
1  13.0  comp
2   NaN  mech
3  19.0   ecs

In [9]:
# to drop the coloumn
df.drop("age",axis=1,inplace=True) # axis 1 means full coloum and axis 0 means first row, inplace tells to drop the col in the original table also.

In [10]:
print(df)

    names  dept   salary
0  pranav    it  12000.0
1  kerkar  comp  13000.0
2   rahul  mech      NaN
3   rohit   ecs  20000.0

In [11]:
print(df.shape)
print(df.info())

(4, 3)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   names   4 non-null      object
 1   dept    4 non-null      object
 2   salary  3 non-null      float64
dtypes: float64(1), object(2)
memory usage: 228.0+ bytes
None

Broadcasting

In [12]:
df['salary']=df['salary'] + 5000
df['salary']

0    17000.0
1    18000.0
2        NaN
3    25000.0
Name: salary, dtype: float64

Renaming coloumn

In [13]:
df.rename(columns = {'dept':"Department"},inplace = True)
print(df)

    names Department   salary
0  pranav         it  17000.0
1  kerkar       comp  18000.0
2   rahul       mech      NaN
3   rohit        ecs  25000.0

In [14]:
print(df['Department'].unique())
print(df['Department'].value_counts())

['it' 'comp' 'mech' 'ecs']
Department
it      1
comp    1
mech    1
ecs     1
Name: count, dtype: int64

New Column

In [15]:
df['New Salary']=df['salary']*10
df

    names Department   salary  New Salary
0  pranav         it  17000.0    170000.0
1  kerkar       comp  18000.0    180000.0
2   rahul       mech      NaN         NaN
3   rohit        ecs  25000.0    250000.0